const posts1 = {
    "career": {
        title: "Про кар’єрний шлях дизайнера",
        html: `
        <h1>Про кар’єрний шлях дизайнера</h1>
        <p>
            Якщо ви починали разом зі мною років п’ятнадцять тому, можливо, були в 
            захваті від буму технології й того, які можливості вони відкривали перед людством. 
            І, вірогідно, так само як і я, хотіли долучитися до цього процесу створення світу 
            майбутнього — цифрового світу.Або ж ви більш творча людина й не акцентувалися саме 
            на розв’язанні проблем користувачів, розвитку технологічного бізнесу, а просто любите 
            саме ремесло: кольори, сітки, графіку, шрифти тощо.
        </p>
        <p>
            Психологія пропонує нам інше та дуже цікаве пояснення — невротичне. Якісними 
            дизайнерами часто стають тривожні люди, які хочуть займатися дизайном через 
            глибинну потребу контролю. Дизайнери втішаються процесом створення продуктів та 
            контролем над результатом, наведенням ладу там, де вони бачать безлад. Не знаю як вам, 
            а мені це трохи властиво. А всі супер-пупер дизайнери, яких я знаю — невротики кожною 
            клітиною свого тіла 😁
        </p>
        <p>
            Так чи інакше, ми всі закохані в дизайн, але заходимо в нього з різних дверей. І от ви працюєте роками, 
            шліфуєте навички, стаєте сініором, а згодом лідом. Ви поступово прогресуєте в кар’єрі, дивуєтеся чому інші 
            дизайнери марнують дні на ті завдання, що у вас забирають максимум пару годин, стаєте ментором, менеджером 
            невеликої команди врешті-решт. Аж раптом усвідомлюєте, що дизайну у вашій роботі стає дедалі менше. Пройшло 
            приблизно 12 років моєї кар’єри і все це сталося зі мною. У когось це стається набагато раніше, у когось пізніше, 
            але в певний момент наш кар’єрний шлях робить круту петлю й ми починаємо йти в зовсім іншому напрямку. Ми дедалі 
            менше займаємося дизайном. Натомість ми проводимо нескінчену кількість годин у розмовах, у створенні документації, у 
            формалізації процесів, співбесідах, розв’язанні конфліктів та битвах за ресурси.
        </p>
        <p>
            Чому так відбувається? Я бачу для цього пару причин:
        </p>
        <ol>
            <li>Ми обираємо шлях до управління та менеджерських посад, бо думаємо, що так ми будемо більше заробляти та швидше просуватися вгору кар’єрною драбиною. Якщо амбіції та прагнення зростання все ще в наявності, то перед нами просто немає іншої опції, аніж узяти на себе більшу відповідальність і стати керівником.</li>
            <li>Хтось розуміє, що вичерпав себе як робітник за найманням і починає свою справу. Це відома історія й так у світу з’явилися Spotify, AirBnb та інші продукту засновані дизайнерами.</li>
            <li>Бажання спробувати щось нове, водночас не йдучи на ридальні зміни та втрачаючи попередні досягнення.</li>
            <li>Розвиток того самого неврозу — неусвідомлене бажання мати ще більший контроль над процесом та результатом.</li>
        </ol>        
        <p>
            На тлі цих рефлексій неодмінно постає порівняння з іншими професіями. Чи так само відбувається в кар’єрі інженера, лікаря, кухаря, музиканта, письменника?.. І ми бачимо, що заснування бізнесу для інженера це швидше рідкість, лікар не обов’язково стає менеджером лікарні, музикант не керує оркестром, а письменники не відкривають видавництв. Усі вони майже завжди намагаються стати провідними, вузькоспеціалізованими, незамінними фахівцями у своїй галузі. Тоді, що не так із дизайнерами? Напевно, так влаштована наша галузь і саме так у ній склалися правила гри. 
        </p>
        <p>Тоді треба поставити питання інакше: чи влаштовує це дизайнерів? І якщо мене особисто захоплює управлінська робота, то як бути з тими, хто не хоче переходити до розряду менеджерів? Хто хоче займатися дизайном, йти за тими мотивами, що привели їх до цієї діяльності? Чи можуть бути інакші правила?</p>
        <p>Можуть.</p>
        <p>У них зацікавлені самі дизайнери, але також і бізнес. Бо коли дизайнери згасають і переходять до «управління», компанії втрачають цінних робітників (ефективній управлінській діяльності ще треба навчитися й набратися досвіду). </p>
        <p>Останнім часом бачу, як дедалі більше з’являється Principle дизайнерів у різних компаніях, а також дизайн-консультантів (а ще пару разів бачив таке собі неофіційне «звання» — дизайн-інфлюенсера в компанії такій-то). Розібравшись у тому, що вони роблять та в чому їхня відмінність від лідів та сініорів, я побачив, що суть зводиться до вже відомої нам моделі T-shaped. Коли до навичок дизайн крафту, додається глибинне знання ще з кількох сфер діяльності, але немає управлінського фактора. Тоді дизайнер дістає ще більше довіри керівництва, ще більше «місця за столом» та унаслідок має вагомий вплив на саму організацію, її бізнес-цілі та робочі процеси. </p>
        <p>Так, поки що немає чіткого різноманіття тих самих тайтлів для таких дизайнерів, що переросли рівень сініора, але їхні прибутки значно вищі, а за рівнем впливу їх можна порівняти з головою дизайн-відділу, дизайн-директором, або навіть Chief design oficer. Це лише питання часу, коли T-shaped отримає своє формальне зображення у званнях за підписання контрактів.</p>
        `,
    },
    "design-cv": {
        title: "10 порад для ефективного резюме дизайнера",
        html: `
            <h1>10 порад для ефективного резюме дизайнера</h1>
            
            <p>Ваше резюме має ефективно демонструвати ваші навички, досвід і здібності в галузі. Резюме — це перше, що побачить HR, а також менеджер, що наймає. І портфоліо буде відкрите лише за умов, якщо ваше резюме виграло конкуренцію серед сотень інших. А отже, ви маєте підійти до створення резюме так само творчо, як підходите до будь-якого іншого продукту, що ви розробляєте.</p>
            <p>Спочатку мені здавалося, що це очевидна річ і тому не варта чергового проговорення. Але з тих сотень резюме, що я побачив за останні пару місяців, 90 % з них були схожі на резюме менеджерів, чи розробників, але аж ніяк не дизайнерів. Складається враження, ніби більшість дизайнерів не розуміє, наскільки важливим для успішного пошуку роботи є їхнє резюме. Тож я вирішив, що потрібно чітко визначити критерії гарного резюме для дизайнерів і поділитися ними зі спільнотою.</p> 
            <img src="/images/blog/5.gif" alt="" />

            <p><strong>Резюме — це дизайн проєкт</strong></p> 
            <p>Ваше резюме — це ваше обличчя, а портфоліо — душа. Покажіть себе з кращої сторони, не обмежуйтеся лише примітивним текстовим файлом, який складно сканувати.</p>
            
            <p><strong>1. Структура</strong></p> 
            <p>Досвід роботи найважливіше. Показуйте ваші місця роботи в хронологічному порядку, де зверху буде актуальне, останнє місце роботи.</p>
            
            <p><strong>2. Метрики</strong></p> 
            <p>Пишіть про досягнення. Скільки ви зробили застосунків, банерів, презентацій. Як це вплинуло на бізнес? Підвищили конверсію, знизили drop off, зменшили кількість запитів до служби підтримки? Вкажіть це в описі! І не бійтеся писати детальні описи — це дуже важливо та є запорукою вашої перемоги!</p>
            
            <p><strong>3. Навички та ключові слова</strong></p>
            <p>Першим, хто скануватиме ваше резюме буде HR, який може й гадки не мати про дизайн процеси, UX тощо. Але вони знають, що дизайнер має володіти Figma, робити дослідження, розуміти, що таке дизайн мислення та мати змогу намалювати ілюстрацію. В деяких компаній резюме проходять крізь автоматичні фільтри й підсвічують необхідні ключові слова. Якщо їх немає, то HR відхиляє заявку.</p>
            
            <p><strong>4. Естетика</strong></p>
            <p>Пам’ятайте, що кожен дизайн має дихати, мати простір. Розбивайте інформацію на блоки, робіть марковані списки, додавайте іконки. Зробіть ваше резюме приємним для перегляду.</p>

            <p><strong>5. «Хороший дизайн — це якомога менше дизайну»</strong></p>
            <p>Водночас пам’ятайте про баланс. Якщо ваше резюме буде виблискувати різноманітними шрифтами, різними за стилями ілюстраціями, нерелевантною інформацією — усе це вб’є дизайн вашого резюме.</p>

            <p><strong>6. Розмір</strong></p>
            <p>Існує упередження, що резюме має вміщатися на одну сторінку. Дійсно, HR має просканувати першу сторінку й отримати всі відповіді на свої питання. Проте це не означає, що резюме має бути втиснуте на одну сторінку. Якщо у вас уже 10 років досвіду і є що розповісти — пишіть про це! Також непогано вставити прев’ю своїх найкращих проєктів і дати на них посилання окремо.</p>

            <p><strong>7. Інтерактивність</strong></p>
            <p>У вашому резюме мають бути посилання на ваше портфоліо, соціальні мережі, email. Зробіть ці посилання робочими й не залишайте пласким текстом.</p>
            
            <p><strong>8. Позбудьтеся всього зайвого</strong></p>
            <p>Хобі? Те, що ви любите грати в футбол — це чудово! Але це не робить вас кращим дизайнером і не додає вартості вашій кандидатурі. Хіба що ви відправляєте резюме на посаду дизайнера у футбольний клуб.</p>

            <p><strong>9. Кастомізація</strong></p>
            <p>До речі, про футбол… Ви не зможете мати одне універсальне резюме, що працюватиме на вас щоразу для будь-якої вакансії. Адаптуйте його до посади, на яку подаєтесь. Якщо це роботу у футбольному клубі дизайнером у відділ маркетингу — розкажіть про свій досвід роботи над аналогічними проєктами, сконцентруйтеся на релевантних маркетингових метриках.</p>
            <p>Вивчіть компанію та роль, на яку ви претендуєте, і підкресліть ті аспекти вашого портфоліо та досвіду, які відповідають їхнім конкретним вимогам. Це продемонструє ваше розуміння їхніх потреб і покаже, що ви добре підходите для цієї посади.</p>
            
            <p><strong>10. Увага до деталей</strong></p>
            <p>Зазвичай ця риса вказана в описі будь-якою дизайнерської вакансії. Тож якщо ваше резюме містить хибодруки, помилки та візуальний шум — ви програєте конкурентну боротьбу.</p>
        `
    },
    "design-leader": {
        title: "Як стати дизайн-лідером",
        html: `
            <h1>Як стати дизайн-лідером</h1>
            <h2>Або поради для дизайнерів, які хочуть дістати «місце за столом» прийняття рішень</h2>
            <img src="/images/blog/img-blog-1.jpg" alt="" />
            
            <p>
                Ця стаття є продовженням допису Вови Сафонова з його блогу на тему <a href="https://consciouscompetenceua.substack.com/p/vs" target="_blank">«Реактивний vs проактивний дизайн»</a>. Я вирішив доповнити її конкретними порадами та прикладами їхнього застосування з практики, аби надати цим думкам практичності й аби ви мали певного роду інструкцію того, як перевести сприйняття дизайну в компанії із ситуативної функції покращення інтерфейсу в необхідний інструмент для успіху бізнесу.
                <br /><br />
                Коротке резюме проблематики та зазначеної вище статті для повноти контексту:
                <br /><br />
                <strong>Проблема:</strong> В нашій діяльності часто трапляється так, що дизайн починає сприйматися в команді/компанії, як реактивна функція, що спрямована на покращення зручності, або естетики окремих частин цифрового продукту. Стратегічна цінність дизайну нівелюється.
                <br /><br />
                <strong>Чому так стається?</strong> Дизайнери самі часто не розуміють потенційну стратегічну силу дизайну та не комунікують свої рішення достатньо ефективно. Бути спеціалістом, який реагує точково на певні запити — зручніше, ніж проявляти проактивність. Стратегічний підхід у дизайні потребує від спеціалістів навичок, що виходять за межі самого дизайну. Це складно та некомфортно.
                <br /><br />
                <strong>Як наслідок</strong>, дизайнери часто працюють у реактивному режимі, марнують більше часу на погодження дизайну з іншими членами команди, гублять довіру та сприймаються як інструмент втілення ідей, а не їхнє джерело. Тепер уявімо, що ми стали досить дорослими спеціалістами й у нас зародилося бажання змінити цю ситуацію! Або ж ви змінюєте роботу й хочете не припуститися тих помилок, що вели до стану двигуна пікселів. Натомість ви хочете не лише закривати запити менеджерів та забезпечувати розробників спеками, а дістати нарешті те саме, омріяне місце за столом прийняття рішень.
            </p>
            
            <h3>1. Усвідомити, який саме ви дизайнер і яка від вас користь? Це перший і найпростіший крок.</h3>
            <p>Запитайте себе, чому ви займаєтеся саме продукт-дизайном? Як ви тут опинились? Чи це випадковість, чи усвідомлене прагнення? Чому ви не працюєте графічним, не UI й навіть не UX/UI дизайнером? Певно, тому що ви прагнули створювати цифрові продукти! І аби створювати їх, ви маєте розв’язувати певні користувацькі проблеми й так заробляти гроші для бізнесу. Це залізна формула, на якій будується все інше. Тож якщо ви передусім ставите красу чи зручність інтерфейсу, концентрується на цьому — поради не будуть мати особливого сенсу. Аби мати можливість стати дизайнером продукту, треба вистрибнути з мислення, де головують пікселі. </p>
            
            <h3>2. Насичувати експертність недизайнерськими навичками, або «Говорити мовою бізнесу/розробки/маркетингу» тощо.</h3>
            <p>
                Оскільки ми є дизайнерами продукту, ми стаємо тими, хто об’єднує інші команди в процесі роботи. Так, коли ми кажемо про дизайн продуктів, це стає різноплановим процесом, що вимагає різних навичок та експертностей.
                <br /><br />
                Тому навчитися говорити мовою бізнесу чи розробки — перша порада, яку ви завжди почуєте в контексті розв’язання цієї проблеми. Але часто-густо ця порада залишається доволі абстрактною. Що це означає насправді?
                <br /><br />
                Дві новини, як завжди: добра й погана. Добра — вам не треба створювати власну компанію, або вчитися кодити й розбиратися в нюансах JavaScript та VUE (підставити необхідне). Погана — вам однаково треба пірнути в ці теми, навчатися та заглибитися в ці теми настільки глибоко, аби вам стало комфортно вести бесіди з підприємцями, розробниками та маркетологами.
                <br /><br />
                Як зрозуміти, що ваша експертність у цих темах достатня? Це стає зрозуміло, коли ви можете чітко артикулювати свої рішення та підібрати аргументацію для певного стейкхолдера:
            </p>
            <ul>
                <li>Бізнес. «Ми маємо дані, що свідчать про те, що наша сторінка з 404 помилкою має забагато трафіку. Це означає, що ми маємо десь биті посилання, які ведуть на цю сторінку. Знайти їх всі буде занадто витратно по часу, але ми можемо приділити достатньо уваги саме 404 сторінці, зробити повноцінний дизайн і запропонувати користувачам такі пропозиції, аби не втратити їх».</li>
                <li>Розробка. «Ми розробили цей дизайн у такий спосіб, аби використовувати готові рішення з Material 3 й так пришвидшити розробку».</li>
                <li>Маркетинг. «Ми знаємо з досліджень, що одна з головних потреб наших користувачів є X, тому ми пропонуємо використати саме ці скріншоти з продукту й такі меседжі на рекламних банерах. Ми підготували кілька банерів, що базуються на цій гіпотезі й ми можемо провести їхнє тестування, аби подивитися, як це вплине на конверсію».</li>
            </ul>
            
            <p>
                Всі ці приклади об’єднує одне — розуміння принципів мислення кожного зі стейкхолдерів. Жоден підприємець не є ворогом своєму бізнесу. Якщо ви пропонуєте рішення, які мають на меті з найменшими витратами принести більше грошей — ви здобудете довіру. Якщо ви пропонуєте розробці зробити щось простіше, використати готові фреймворки, бібліотеки тощо — ви дістанете їхню довіру. Маркетинг — це завжди про експерименти та пошук варіантів максимальної конверсії. Запропонуйте це і ви також дістанете і їхню довіру.
            </p>
            
            <h3>3. Працювати з метриками та даними</h3>
            <p>
                Підхід продукт дизайнера до самого дизайну суттєво відрізняється від підходів графічних дизайнерів чи дизайнерів суто інтерфейсів. Ми маємо постійно дивитися на метрики та всі наші дизайн-рішення мають спиратися на фактичні дані. Якщо ваші аргументи закінчуються на тому, що «так буде зручніше», або «так заведено робити скрізь у подібних випадках» — ви не здобудете довіри. Навпаки, вас будуть використовувати виключно як сервіс, який знає, як найкраще імплементувати вже певне бачення. На практиці, ви маєте приділяти увагу моніторингу доступних систем трекінгу: Hotjar, Google Analytics тощо. Запускати опитування чи проводити тести самостійно за допомогою таких інструментів, як Useberry, наприклад. Продукт-дизайнери є адвокатами користувачів не тому, що ми знаємо як краще, а тому, що ми знаємо (маємо знати!) усе про наших користувачів.
                <br /><br />
                Отже, коли ви не вважаєте за валідним аргументи: «це покращує користувацький досвід» та «цей дизайн проходить евристичне оцінювання за правилами NNG» (всім пофіг), а замість цього кажете про гроші та метрики, знаєте, як дістати цю інформацію та загорнути її для окремого стейкхолдера — ось тоді ви й розмовляєте «мовою бізнесу».
            </p>
            
            <h3>4. Ініціювати рішення, а не чекати завдань</h3>
            <p>
                Як я вже зазначав вище — ми є тією ланкою, яка об’єднує різні експертизи, ми будуємо містки між бізнесом та користувачами, між командами та цілями компанії.
                <br /><br />
                Якщо ви хочете бути не просто сервісом, тоді ви маєте займати проактивну позицію. Ви володієте даними, розумієте користувачів та нагальні потреби бізнесу? Це саме та формула, завдяки якій ви можете пропонувати ідеї та нові процеси.
                <br /><br />
                Очікування від бізнесу насправді є такими, що це ви будете в змозі самостійно ставити задачі розробникам та контролювати якість, а не те, що вам будуть приносити задачі на тарілочці із чіткими критеріями.
                <br /><br />
                Приклад із практики. У компанії, де я працював раніше, ми проходили через фазу ребрендингу. Завдання стояло так, що ми маємо змінити стилі, оновити інтерфейс і жодним чином не чіпати бекенд. Водночас ми, команда продукт дизайнерів, чудово знали про певні болі наших користувачів. Деякі з них було можливо вирішити простою реорганізацією інформації на сторінці. Тож ми запропонували ці рішення в межах ребрендингу, адже вони не потребували жодних додаткових ресурсів, але могли суттєво відобразитися на певних метриках (drop off зі сторінки реєстрації зокрема). Такі ініціативні рішення будуть із радістю прийняті, а ви дістанете додаткову довіру та ще більше місця за тим самим столом.
            </p>
            

            

            
            <h3>5. Аргументація ідей, або як переконати тих, хто «в дизайні не шарить»?</h3>
            <p>
                У якій би чудовій компанії ви б не працювали, ви маєте пам’ятати, що окрім створення дизайну та іншого, вам доведеться «продавати» дизайн. Річ у тім, що часто вам доведеться переконувати людей, які не мають жодного стосунку до дизайну, ніколи не чули про double diamond, або ж дизайн-мислення.
                <br /><br />
                Що робити тоді? Найкращою стратегією є практика з психології, яка пропонує вам дивитися на вашого співрозмовника, як на 5-річну дитину й пояснювати все детально, розжовуючи кожний аспект.
                <br /><br />
                Інша крута практика: показувати, замість розповідати. Бо слова — це супер, але візуалізація — краще. Покажіть два варіанти: «Ось так було, а так стало». Продемонструйте, як змінюється функціональність, або ж емоція від використання. Люди люблять before & after, особливо, якщо «після» дійсно вражає.
                <br /><br />
                Йдемо далі. <a href="https://vadimgrin.com/metaphors" target="_blank">Метафори про які, я писав раніше</a>. Людям, особливо тим, хто не працює з дизайном, складно уявити, чому це важливо. Тож треба пояснювати за допомогою простих аналогій. Наприклад:
            </p>
            <ul>
                <li>«Відсутність білого простору на сторінці — це як спроба говорити на переповненій вечірці».</li>
                <li>«Поганий UX — це як лабіринт без виходу. Ніхто не хоче ним користуватися».</li>
            </ul>
            <p>
                Це працює просто — це все ще слова, але вони вже працюють на візуалізацію та на підтягування знайомих сюжетів.
                <br /><br />
                Якщо нічого не спрацьовує і вам не вдається переконати словами чи прикладами, запропонуйте тест: «Протестуймо ці два варіанти на реальних користувачах і подивимося результати». Коли цифри говорять самі за себе, аргументи стають не потрібні.
            </p>
            
            <h3>6. Ділитися успіхами</h3>
            <p>
                Навіть маленький успіх, якщо він визнаний, може суттєво змінити ставлення до вас та до вашої роботи. Коли успіхи відзначаються публічно, це формує культуру вдячності, де кожен відчуває, що його внесок важливий. Це зміцнює зв’язки між колегами, зменшує рівень стресу. І тут, звісно, є одне «але». Дуже рідко хтось прийде й на весь Slack прокричить, який ви молодець. Можливо, ваше ім’я згадають на якомусь слайді та й годі.
                <br /><br />
                Вам конче потрібно демонструвати власні успіхи самостійно. Це ще одна частинка до позиції проактивності.
                <br /><br />
                Приклад із практики. Нещодавно ми автоматизували в компанії взаємозв’язок токенів у Token Studio в Figma та коду на GitHub. При оновлені токенів у Figma відбувається автоматичний pull request на GitHub. Може лунати трохи дивно для тих, у кого все добре з дизайн-системами та процесами навколо неї, але в нашому випадку, де команда дизайн-системи відсутня, це великий крок уперед. Дизайн-команда зробила маленьку презентацію на 5 хвилин під час загальної зустрічі, аби показати, як це підвищує швидкість оновлень в умовах обмежених ресурсів.
                <br /><br />
                Інший приклад. Колись, на початку своєї кар’єри, я працював дизайнером у відділі маркетингу. Моїм завданням було робити різні посадкові сторінки. Інколи банери. Відділ маркетингу, звісно, звітував про успіх певних кампаній загалом, але я і собі зробив презентацію для своїх менеджерів і показав найуспішніші сторінки (з погляду конверсії) і зазначав вплив цікавих дизайн-рішень на бізнес.
                <br /><br />
                Дуже часто співробітники не знають, навіщо вони роблять свою частину задачі. Визнання успіху допомагає побачити картину загалом.
                <br /><br />
                Як це робити правильно?
            </p>
            <ol>
                <li>Робіть це регулярно. Не треба робити такі презентації виключно перед річним оглядом вашої роботи. Діліться успіхами на зустрічах та у внутрішніх каналах компанії.</li>
                <li>Будьте конкретними. Скажіть, хто й що зробив та який це дало результат.</li>
                <li>Використовуйте різні формати. Це може бути просте повідомлення, пост, слайди, відео.</li>
                <li>Не забувайте про маленькі перемоги. Вони також заслуговують уваги!</li>
            </ol>

            <h3>7. Будувати партнерські стосунки</h3>
            <p>
                Окрім усього, що було зазначено вище, важливо налагоджувати зв’язки з колегами в компанії. Річ у тім, що ви працюєте не лише з вашим безпосереднім керівником. Ви можете бути залученими в розв’язанні різноманітних задач і працювати з представниками різних відділів. І немає нічого краще за те, аби бути впевненим, що всі, з ким ви працювали, нададуть найкращий фідбек, бо ви допомогли їм зробити це вчасно та якісно.
                <br /><br />
                Адже дизайнер — це про мистецтво комунікації.
            </p>
            
        `
    },
    "design-thinking": {
        title: "Коли дизайн-мислення не працює?",
        html: `
            <h1>Коли дизайн-мислення не працює?</h1>
            <p>Маю зізнатися, що дизайн-мислення було для мене певною догмою, що ніколи не підводила. Донедавна. Останнім часом я стикаюся з великою кількістю перешкод для застосування цієї методології. Й ось із яких саме причин:</p>
            
            <ol>
                <li>
                    Брак емпіричних даних. Дизайн-мислення не ґрунтується на емпіричних даних і йому бракує наукової точності. Хоча дизайн-мислення часто використовується для розробки нових цифрових продуктів або послуг, воно може не підійти для розв’язання складних проблем, що потребують більш аналітичного та доказового підходу. 
                    <br /><br />
                    <i>Приклад із практики.</i> Продукт, над яким я працюю зараз неймовірно складний і його можна поставити в категорію B2B2B2C. Серед наших користувачів: агенції, що надають послуги власним клієнтам за допомогою нашого продукту, індивідуальні підприємці, розробники та маркетологи, малий та середній бізнес. Нашого «клієнта» доволі складно визначити в традиційному розумінні.
                    <br /><br />
                    Ми не можемо розвісити персони по офісу, не рятує і JTBD методологія… Команда дослідників невпинно працює, аби надати якомога більше даних задля розуміння наших користувачів. Однак неоднорідність клієнтів, їхні найрізноманітніші вимоги, а головне — секретність роботи, а також користувацьких даних та неможливість наших клієнтів показати й розповісти про всі свої робочі кейси, створює суттєву нестачу емпіричних даних і ускладнює першу фазу — «Визначення» (Define).
                </li>
                
                <li>
                    Дизайн-мислення підкреслює важливість емпатії та розуміння потреб і бажань користувача. Проте деякі критики стверджують, що це може призвести до зосередження на поверхневих потребах, а не на глибинних проблемах. Крім того, самої лише емпатії може бути недостатньо для розв’язання складних проблем, які потребують більш систематичного та аналітичного підходу. 
                    <br /><br />
                    <i>Приклад із практики.</i> Уже зазначена вище неоднорідність наших користувачів та неможливість практично дослідити їхній робочий процес від початку й до кінця, унеможливлює для нас, дизайнерів та дослідників, повноцінний прояв емпатії. Замість емпатії у вигляді результату довгострокового занурення в життя та проблеми користувачів, ми маємо кілька швидких інтерв’ю з експертами, на яких набуваємо лише поверхневого розуміння їхніх потреб.
                </li>

                <li>
                    Брак гнучкості. Методологія дизайн-мислення каже нам робити речі на низькому рівні точності, швидко тестувати, вчитися на результатах та повторювати цей процес. Так ми постійно шукаємо баланс між продуктом та нашими користувачами.
                    <br /><br />
                    Але світ бізнесу сповнений конкурентами, жорсткими дедлайнами, необхідністю давати результати тут і зараз. Реальність дизайн процесу, особливо у великих компаніях, доволі далека від теорії застосування дизайн-мислення.
                    <br /><br />
                    <i>Приклад із практики.</i> Раптом Apple запускає новий алгоритм збору даних користувачів (SKAd Network) і всі принципи, на яких ми базували наші рішення до того — нівельовані. Цінність нашого продукту для користувачів моментально падає. Дизайни, що ми розроблювали, тестували, запускали, раптом стають неактуальні. Компанії необхідно зберегти клієнтів, а дизайнерам і розробникам відповідно, в умовах повної невизначеності та з браком емпіричних даних, реконструювати частину продукту в дуже стислі терміни.Тому методологія особливо погано підходить для розв’язання проблем у сферах, що швидко змінюються або характеризуються високим рівнем невизначеності.
                </li>
            </ol>

            <p>
                Висновок насправді дуже простий: дизайн-мислення, як методологія розв’язання проблем, що орієнтована на людину, має свої однозначні переваги й може успішно використовуватися, але на практиці це відбувається фрагментарно та лише в поєднанні з іншими методологіями, де дизайн-мислення стає лише додатковим, допоміжним засобом, а критично-раціональний аналіз залишається основною опорою в пошуці та прийнятті рішень.
            </p>
        `
    },
    "designers1": {
        title: "Пол Ренд і Сол Басс",
        html: `
            <h1>Пол Ренд і Сол Басс</h1>
            <p>
                Справжнє ім’я Пола Ренда (1914 - 1996)— Перетц Розенбаум. Цілком ймовірно, що сьогодні він залюбки б залишився Перетцом, але тоді часи були інакші. Він народився в Нью-Йорку в ортодоксальній єврейській сім’ї. З дитинства він захопився образотворчим мистецтвом і вже в юному віці почав малювати вивіски для продуктової крамниці свого батька.
            </p>

            <p>
                <img class="img-float-left" src="/images/blog/img-blog-2.jpg" alt="" />
                Кар’єра почалася зі створення <strong>стокових зображень</strong> (мене здивувало, що в 30-х уже були стокові зображення), які постачалися в різні газети та журнали. Саме тоді Перетц вирішив замаскувати свою єврейську ідентичність, і скоротив ім’я до суто американського Пола та взяв Ренд від прізвища свого дядька.
                <br /><br />
                У свої двадцять років він уже створював роботи, які почали завойовувати міжнародне визнання. Пол Ренд швидко дістав репутацію «сірого кардинала» графічного дизайну.
            </p>

            <p>
                Ренд був найвідоміший корпоративними логотипами, які він створив у 1950-х і 1960-х роках: <strong>IBM, ABC, UPS, NeXT</strong>. Він був одним із перших американських комерційних художників, які прийняли та практикували швейцарський стиль графічного дизайну.
            </p>
            
            <img src="/images/blog/img-blog-3.jpg" alt="" />

            <p>
                Своє творче кредо Ренд сформулював так: «Візуальна комунікація будь-якого роду, від рекламних щитів до побутових оголошень, мусить вважатися втіленням форми та функціональності, об’єднанням гарного та корисного». Еге ж схоже на всі сьогоденні постулати в дизайні цифрових продуктів?
                <br /><br />
                Ренд залишався популярним на ринку й  у похилому віці, <strong>працюючи на замовлення до кінця свого життя, беручи (за чутками) 100 000 доларів за одну роботу</strong>.
            </p>

            <hr/>

            <p>
                Сол Басс (1920 — 1996) — графічний дизайнер та режисер, відомий створенням афіш, постерів для кінофільмів, а також корпоративних логотипів. У 1969 році був дістав Оскар, як найкращий режисер зі своїм фільмом Why Man Creates.
            </p>

            <img style="width: 40%; margin: 0 auto" src="/images/blog/img-blog-4.jpg" alt="" />
            <p>Так само як і Ренд, Басс рано почав навчатися дизайну. Проте слава прийшла трохи пізніше аніж до Ренда. У 1955 році Басс створив вступну заставку до кінострічки «Людина із золотою рукою». </p>
            <img style="width: 50%; margin: 0 auto" src="/images/blog/img-blog-5.jpg" alt="" />

            <p>
                Ця робота набула розголосу за свою сміливість і зробила Басса знаменитим в індустрії дизайну.
                <br /><br />
                Далі Басс працював з Альфредом Хічкоком, Стенлі Кубриком і Мартіном Скорсезе. Серед його найбільш відомих робіт: вступна заставка у фільмі «Запаморочення», «На північ через північний захід» і «Психо». Для останніх Басс створив заставки, використовуючи кінетичну типографіку. І ці революційні роботи вже закарбували ім’я дизайнера в історії.
            </p>

            <div class="photo-2col">
                <img src="/images/blog/img-blog-6.jpg" alt="" />
                <img src="/images/blog/img-blog-7.jpg" alt="" />
            </div>

            <p>
                Заставка запаморочення заслуговує перегляду. Це одна з перших заставок в історії кінематографа, яка не просто інформувала титрами, але задавала настрій, одразу налаштовувала глядачів і створювала певні очікування.
            </p>

            <iframe class="aspect-16-9" width="560" height="315" src="https://www.youtube.com/embed/4CZfSc6nJ8U?si=QePXadpnrt_6TxkT" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
            
            <p>У 70-80 Басс взяв перерву в роботі в кіноіндустрії та працював на різні компанії, створюючи логотипи та фірмові стилі. Найвідоміші його роботи:</p>
            <img src="/images/blog/img-blog-8.jpg" alt="" />
            <p>Сол Басс став одним з перших представників дизайнерів-генералістів. Він графічний дизайнер, але він ще й видатний режисер (Оскар!). Він також був фотографом і займався архітектурою. Він не гребував робити корпоративні стилі та логотипи. Сам він казав, що «дизайн — це спосіб візуального мислення». Тож чим більше ми насичуємо себе різноманітними знаннями та спеціалізаціями, тим зрештою ефективнішим буде наше мислення.</p>
        `
    },
    "hiring-whiteboard": {
        title: "Whiteboard challenge та інші пригоди дизайнера",
        html: `
            <h1>Whiteboard challenge та інші пригоди дизайнера</h1>
            <p>
                Спочатку відбір портфоліо та резюме. Далі HR скринінг. Інтерв’ю з менеджером, що наймає. Whiteboard challenge з дизайнерами. Або ж тестове завдання. Ще кілька інтерв’ю. І на останок, можливо, якась задачка на стратегічне мислення. Особливо, якщо ви lead, або head. А потім ще останнє інтерв’ю, наприклад, cultural fit, або «формальна» зустріч із кимось із найкрутіших керівників, якому ви, зрештою, можете не сподобатися. І все. Нема омріяної пропозиції з нової компанії. Знайомо?
                <br /><br />
                Так сьогодні побудований процес найму дизайнерів в усіх компаніях, від маленьких стартапів до велетнів індустрії. І з кожним разом кількість необхідних бесід збільшується, тестові ускладнюються. Це, звісно, нормально, бо талантів у сфері все більшає, обирати стає складніше, тож і вимоги зростають. А сьогодні й поготів через кризу на ринку й масові звільнення, що сталися не так давно по всьому світу.
                <br /><br />
                Що ненормально, так це те, що пошук роботи виокремився в цілу нову діяльність для дизайнерів, що потребує окремих навичок і досвіду.
            </p>
            <img src="/images/blog/6.gif" alt="" />
            <p>
                Як написав один мій знайомий дизайнер: «Тобі треба показати 150 % умінь, аби використовувати 50 % із них у повсякденній роботі». Й один із найпоширеніших запитів сьогодні до менторів — допомогти підготуватися до інтерв’ю. Бо попри найпрекрасніше портфоліо, чудові комунікаційні навички та все те, що ви дістаєте з реального досвіду роботи, тепер недостатньо. Треба навчитися проходити інтерв’ю, усілякі випробування та подавати себе в тому світлі, у якому хоче бачити вас потенційний роботодавець.
                <br /><br />
                Особливо в процесі найму мене вкурвлює <strong>Whitebard challange</strong>. Це ситуація, коли хотіли, як краще, але вийшло, як завжди. Цей формат з’явився на тлі того, що тестові завдання погано сприймалися кандидатами, бо:
                <br /><br />
                ❌ Компанія просить виконати неоплачувану роботу.
                <br /><br />
                ❌ Компанія дає вигадане завдання аби не було претензії № 1, результат якої важко оцінити.
                <br /><br />
                ❌ Виконання тестового завдання та його подальша презентація вимагають занадто багато часу та зусиль самого виконавця.
                <br /><br />
                Тож ми перемкнулися на те, що даємо вигадане завдання, з непроговореними та дуже специфічними очікуваннями, запаковуємо це в певний фреймворк роботи з дошкою (реальною чи віртуальною), стискаємо до пів години, робимо максимально стресовим і віддаленими від реальної роботи й voilà!
            </p>
            <img src="/images/blog/7.gif" alt="" />

            <p>
                На мою особисту думку whiteboard challenge є найменш ефективним способом оцінки навичок дизайнера. Його головна мета — перевірка вашого процесу мислення та проектування. Але ми, дизайнери, не працюємо виключно над процесом. Ми працюємо над розв’язанням проблем користувача, створюючи продукт. У цій роботі існує безліч перемінних, купа відомих невідомих і цінність нашої роботи не в самому процесі, а в результаті. Так ми впливаємо на процеси та владні їх змінювати, але важить саме те, чого whiteboard challenge не перевіряє.
                <br /><br />
                Один із ключових тезисів цього іспиту полягає в тому, що кандидат має ставити питання, казати, коли він/вона не впевнені. Насправді ж, якщо ви невпевнені, ставите питання, на які вам не дають відповідей та кажете: «Тоді було б добре провести таке-то дослідження» — це червоний прапор у вашому забігу. Бо в кожного інтерв’юера є власні критерії та чіткі очікування. Тож годі й думати, що кандидат зможе легко приборкати страх помилитися, насипати ідеї та ще й паралельно створювати чіткі та зрозумілі ваєрфрейми, користувацькі шляхи тощо.
                <br /><br />
                Іспит відбувається у 30–60 хвилин. Сам процес випробовування вже дуже далекий від реальної практики. І чи дизайн-процеси так відрізняються від одного досвідченого дизайнера до іншого? Навіщо ж тоді перегляд портфоліо, презентація певних робіт та обов’язкові зупинки саме на процесах? Якщо ви не можете визначити процес кандидата в кількох бесідах, чи кандидат підходить на цю роль — ви не розумієте, кого й навіщо шукаєте.
                <br /><br />
                Резюмуючи, три головних мінуси whiteboard challenge:

                <br /><br />
                💔 Концентрація на процесі, а не на результаті.
                <br /><br />
                💔 Whiteboard challenge відірваний від реальності.
                <br /><br />
                💔 Whiteboard challenge найбільш суб’єктивним методом оцінювання навичок та досвіду дизайнера.
                <br /><br />
                На мою думку, перегляд резюме та портфоліо, презентація кількох робіт і кілька співбесід із кандидатом є цілком достатнім для визначення якості професійних навичок та досвіду кандидата.
            <p>
        `
    },
    "leadership": {
        title: "Бути ефективним лідером: що це означає та яка ціна?",
        html: `
            <h1>Бути ефективним лідером: що це означає та яка ціна?</h1>
            <h3>Інсайти, що допомогли мені стати лідером у сфері дизайну</h3>
            <img src="/images/blog/img-blog-9.jpg" alt="" />

            <p>
                Уперше я відчув смак влади 10 років тому, коли став керівником невеликої команди дизайнерів. Тоді мені підпорядковувалися 3 дизайнери. Однак моя робота зводилася до натискання кнопок: «затвердити відпустку», рідкісними зустрічами «тет-а-тет» і розподілом завдань. Я був занадто молодий і недосвідчений, аби стати справжнім лідером, але тоді я зробив свій перший крок в управлінні.
                <br /><br />
                Подальші кілька років своєї кар’єри я провів вивчаючи технології, опановуючи мистецтво створення цифрових продуктів, а також відточуючи свої професійні навички. Усе змінилося кілька років тому, коли управлінські обов’язки почали забирати щонайменше половину мого часу. Я почав більше інвестувати в soft навички: комунікацію, управління конфліктами, психологію тощо.
                <br /><br />
                Тож я занурився у вивчення всього, що міг, про менеджмент і лідерство, намагаючись стати гарним керівником. І найперше, що я зрозумів, це те, що бути хорошим менеджером — це не те саме, що бути хорошим лідером.
            </p>

            <h3>Інсайт 1: менеджер — не є лідером.</h3>
            <p>
                Менеджери можуть бути лідерами, але можуть і не бути ними. Менеджерам притаманна здатність виходити за межі своїх ролей і ставати надихаючими лідерами, але не всі вирішують скористатися цією можливістю, аби керувати з візією та натхненням.
                <br /><br />
                Якщо ви хочете заглибитися саме в управлінську частину історії, я можу порекомендувати вам <a href="https://medium.com/design-bridges/design-manager-types-b12c980576b5" target="_blank">цю статтю</a>, написану моїм колегою по цеху, який є чудовим менеджером дизайнерів. Тут зможете зрозуміти, що таке дизайн-менеджмент і яких навичок він вимагає, насолоджуючись неперевершеною графікою від автора. Але ми тут, щоби поговорити про лідерство, тож рушаймо далі.
            </p>

            <h3>Визначення лідерства</h3>
            <img src="/images/blog/img-blog-10.jpg" alt="" />

            <p>
                Гаразд, спочатку нам потрібно розмежувати менеджерів та лідерів.
                <br /><br />
                Що роблять менеджери? Звичайно, вони мають підлеглих, вони розподіляють завдання і намагаються максимізувати ефективність команди.
                <br /><br />
                Що роблять лідери? Замість підлеглих у них є послідовники. Лідери — це ті, хто визначає загальне бачення та мету. Вони зосереджені на створенні цінності та, що не менш важливо, на тому, щоб інші (окремо взяті спеціалісти) були ефективними. Вплив — це те, у чому вони зацікавлені найбільше.
            </p>

            <h3>Інсайт 2: кількість послідовників, а не підлеглих, вимірює рівень лідерства.</h3>
            <p>
                Чи будь-хто може бути лідером, навіть дизайнер без химерного титулу на кшталт «директор», чи «тім-лід»? Відповідь — так.
                <br /><br />
                Уявіть собі таке: Ісус Христос не був імператором Риму, а лише теслею. На піку своєї кар’єри він мав лише одну справжню команду. У порівнянні з величезною організацією, яку мали такі великі боси, як Август і Тиберій, Ісус не мав абсолютно ніякої влади. Але скільки справжніх послідовників мали ці імператори, і скільки вони мають сьогодні? Пан Ісус же навпроти мав і досі має багато послідовників. І це робить його одним із найбільших лідерів усіх часів (звичайно, якщо не брати до уваги перебільшення церквою його історії постфактум).
            </p>
            
            <h3>Інсайт 3: влада може дати вам кращу відправну точку.</h3>
            <p>
                Багато дизайнерів у своїй кар’єрі стикаються з вибором: залишатися індивідуальним контриб’ютором і розвиватися в межах свого ремесла, намагатися стати незамінним виконавцем, або ж перейти в менеджмент і значно збільшити свій прибуток, здобути владу, а згодом, можливо, і вплив.
                <br /><br />
                Уявімо собі дизайнера, який прагне бути лідером, але не дуже добре вміє робити дизайн. Такий дизайнер рідко просувається корпоративними сходами. Ви можете зі мною сперечатися, і завжди є винятки з правил, але в моїй практиці формула залишається незмінною: <i>ви робите свою роботу добре > ви допомагаєте іншим стати більш ефективними > ви здобуваєте визнання і владу > ви дістаєте шанс впливати на інших.</i>
                <br /><br />
                А потім, якщо цей вплив є цінним, якщо іншим резонує ваше лідерство, і якщо компанія досягає успіху частково завдяки вам, тоді ви можете стати лідером і почати створювати власну армію послідовників.
                <br /><br />
                Тож так, ви можете стати лідером, не маючи влади й високих посад, використовуючи харизму та сильні ораторські навички. Однак, доводячи свою спроможність і просуваючись корпоративними сходами, ви прискорюєте шлях до впливу.
            </p>

            <h2>Як стати лідером?</h2>
            <img src="/images/blog/img-blog-11.jpg" alt="" />
            <p>
                В мережі ви знайдете запаморочливий набір стилів лідерства: демократи та авторитарні лідери, трансформаційні та бюрократи тощо. [Ось один із найбільш повних списків. Усі](https://www.betterup.com/blog/types-of-leadership-styles) вони варті того, аби взяти їх до уваги, але на практиці вони допоможуть вам обрати стиль, виходячи із ситуації, культури компанії та ваших власних особливостей для організації команди.
                <br /><br />
                На початку це не має особливого значення. Найперше, про що ви маєте подумати, це не про те, який стиль ви хотіли б успадкувати, а про те, як завоювати довіру.
            </p>

            <h3>Інсайт 4: люди тягнуться до тих, кому довіряють, незалежно від посади.</h3>
            <p>
                Якщо все починається з довіри, то як її здобути?
                <br /><br />
                <strong>Крок 1. Встановлюйте планку якості та ставайте прикладом для інших.</strong>
                <br /><br />
                У певному сенсі нам, дизайнерам, пощастило — ми є сполучною ланкою між бізнесом, користувачами та командами розробників. Водночас інші можуть страждати від такого широкого кола обов’язків і необхідності бути ефективними комунікаторами. Але ті, хто може працювати лише в заданих рамках і не може впоратися з умовами невизначеності, не готові рухатися вгору і ставати лідерами.
                <br /><br />
                У будь-якому разі, все починається з результатів, які ви досягаєте, з якості вашої роботи. Якщо ваші рішення (або ви були частиною цих рішень) призвели до того, що користувачі стали щасливішими, а компанія отримала більше прибутку — вітаю, ви робите перші необхідні кроки!
                <br /><br />
                Ваші розробки, їхня якість, як ви організовуєте свою роботу, а також те, як ви демонструєте і обстоюєте свої рішення — це фундамент, з якого починається лідерство. Люди починають звертатися до вас за порадою. Вам дають дедалі складніші завдання. Зрештою, ви здобуваєте перших підлеглих, які допомагають вам досягати поставлених цілей.
                <br /><br />
                <strong>Крок 2. Робіть інших ефективними.</strong>
                <br /><br />
                Щойно ви стаєте певною рольовою моделлю для інших, тоді для вас відкривається чергове вікно можливостей. Навчитися робити інших ефективними — це наступний крок на шляху.
                <br /><br />
                Що для цього потрібно робити? Від простої моральної підтримки ваших колег, до впровадження нових процесів і церемоній для прискорення або підвищення ефективності окремих людей та особистого наставництва інших дизайнерів. Такі дії з вашого боку зміцнять ваш авторитет і дадуть вам визнання як лідера.
            </p>

            <h3>Інсайт 5: на відміну від менеджера, який дбає про успіх команди, лідер дбає про успіх людей.</h3>
            <p>
                Ось фраза, яку я почув на курсі NNG під назвою <a href="https://www.nngroup.com/courses/ux-leadership-skills-for-all/" target="_blank"> «UX Leader: Essential Skills for Any UX Practitioner»:</a>
            </p>

            <h3>Інсайт 6: <i>«Лідерство — це здатність людини бути ефективною»,</i> Еван Санволл</h3>
            <p>
                Відтоді я використовую це як девіз.
                <br /><br />
                <strong>Крок 4. Розвивайте таланти інших.</strong>
                <br /><br />
                Коли ви починаєте дбати не лише про себе та свій успіх, але і про успіх ваших колег, ви починаєте створювати ту саму базу послідовників. Фундаментальною основою для масштабування вашого лідерства є те, скільком талантам ви допомогли розвинутися, скільки людей завдячує вам просуванням по кар’єрних сходах, успішним подоланням викликів і конфліктів, розширенням своїх професійних навичок.
                <br /><br />
                <strong>Крок 5. Підвищуйте свій престиж.</strong>
                <br /><br />
                У міру того, як ваша діяльність і успіхи продовжуватимуться, ви побачите, що навіть зовсім незнайомі люди, які навіть не є членами вашої команди, можуть стати вашими послідовниками. По суті, це вершина лідерства, коли люди йдуть за вами через те, ким ви є, і ті цінності, які ви представляєте.
            </p>

            <h2>Яка ціна лідерства?</h2>
            <img src="/images/blog/img-blog-12.jpg" alt="" />
            <p>
                Більше не буде ніякого дизайну. Так само, як немає його в цій статті.
                <br /><br />
                Необхідні кроки та навички для того, аби стати лідером, будуть ідентичними для розробника, інженера та лікаря. І для всіх них ціна розвитку як лідера однакова: чим далі, тим менше ремесла.
                <br /><br />
                Стати керівником та лідером не є природним розвитком у кар’єрі дизайнера. Це вимагає іншого набору навичок, які ви не можете здобути, працюючи дизайнером.
            </p>

            <h3>Інсайт 6: чим глибше ви занурюєтеся в лідерство, тим менше ви будете займатися дизайном.</h3>
            <p>
                У якийсь момент ви побачте, що вся ваша робота тепер — це планування, години спілкування з іншими людьми й тонни думок про них, їхню роботу та їхні життя. А у вашому житті не залишилося жодного пікселя. Це і є ціна, яку платить кожен фахівець, коли стає менеджером і лідером.
            </p>
        `
    },
    "likeartist": {
        title: "«Кради, як митець»",
        html: `
            <h1>«Кради, як митець»</h1>

            <p>«Красти» дизайни, як митець означає трансформувати те, що вже було створено, а не просто копіювати. Будь-який найвидатніший митець надихається роботами інших, хто був до нього та позичає, комбінує і зрештою трансформує певні прийоми, деталі та сюжети. Усе оригінальне завжди проростає з того, що вже існує.</p>
        
            <p>Я послуговуюся цим принципом і у власній роботі. На початку кар’єри я хотів створювати унікальні та яскраві речі, дістаючи їх легко та просто з голови. Проте нічого надто приголомшливого з цього не виходило.</p>

            <p>З досвідом я зрозумів: аби робити дизайн, що розв’язуватиме проблеми користувачів, нестиме позитивні емоції й буде оздоблений wow-ефектами, то спочатку мені треба дослідити дизайнерську спадщину. Необхідно зрозуміти, що створили інші дизайнери до мене, закарбувати в пам’яті існуючи патерни та найкращі практики, ретроспективно передивитися та відрефлексувати тренди.А потім необхідно вдягти капелюха такого собі діджея та спробувати заміксувати все те, що бачиться ефективними, або ж красивим. </p>
        
            <p>
                <strong>Як це робити на практиці?</strong>
                <ol>
                    <li>Насамперед вам знадобиться moodboard. Скажімо, ви працюєте над застосунком соціальної мережі. На вашому першому та головному екрані — стрічка повідомлень. Ми йдемо на dribbble, behane, pinterest, галерею red dot awards тощо і зберігаємо на своїй дошці все те, що вбирає очі. І це не обов’язково застосунки інших соціальних мереж, це може бути все, що завгодно! Ви просто шукаєте речі, які вам подобаються та які потенційно можна використати у вашому дизайні.</li>
                    <li>Далі ви маєте зрозуміти, навіщо дизайнер використав той чи інший елемент, що вас чіпляє. Чому він вас чіпляє? Це просто красиво, або це поліпшує досвід користувача? Як ви це можете використати у своєму контексті? Проаналізуйте свої знахідки.</li>
                    <li>Тепер починається «творчий пошук» і діджейська робота в дизайні: ви ітеруєте, шукаєте і створюєте свою власну, оригінальну роботу, базуючись на ідеях та концептах з інших робіт.</li>
                </ol>                
                Наприклад, ви знайшли певний цікавий дизайн навігації й використали її принцип. Додали власні іконки, модифікувавши їх та наблизивши до побаченої в іншій роботі стилістики. Наклали кольори бренду. А вишенькою на торті стала невеличка й легка анімація іконок із чергового побаченого раніше джерела.
            </p>

            <p>У своїй книзі «Кради, як митець» Остін Клеон пропонує взагалі перестати турбуватися про те, аби бути оригінальним. Це особливо важливо для дизайнерів, які не є по суті митцями, а швидше інформаційними інженерами. Він пропонує натомість зосередитися на ефективному початку роботи — на прокрастинації.</p>

            <p>Прокрастинувати в процесі творчого пошуку — це не просто нормально, це ще й потрібно і є досить продуктивною практикою. Раптові осяяння і спалахи геніальності часто трапляються саме тоді, коли ви дозволяєте своєму розуму блукати. Клеон пропонує зробити прокрастинацію частиною рутини.</p>

            <p>Робота дизайнера завжди є результатом усього того, що вплинуло на нього, і чим різноманітніші шляхи вашого блукання та пошуку, тим більш креативним та оригінальним буде результат.</p>
        `
    },
    "metaphors": {
        title: "Сила метафор",
        html: `
            <h1>Сила метафор</h1>
            <p>
                <strong>Що поєднує цифровий дизайн та літературу, письменника та дизайнера?</strong> Здавалося б, такі різні сфери діяльності, а все ж вони зустрічаються, наче два північних моря і починають взаємодіяти там, де виникає мистецтво метафори.
                <br /><br />
                Влучні, яскраві метафори в літературі, наче стріли Амура, що кидають нас у солодкий полон яскравого тексту. Ми закохуємося в нього і страждаємо від необхідності прощатися з ним, коли він закінчується. Але не всі янголи кохання стріляють влучно. І тоді ми не розуміємо метафор, губимося серед них, насміхаємося з них…
            </p>

            <img src="/images/blog/img-blog-13.jpg" alt="" />

            <p>
                На цьому місці мені пригадався роман «Парфумер» Патріка Зюскінда, як джерело найрізноманітніших метафор, завдяки яким я не просто читав «Історію одного вбивці», але насправді відчував усі запахи по-справжньому! Пам’ятаю, як по закінченню читання, я відчував себе жертвою Стокгольмського синдрому. Мені було часом огидно, моторошно, часом страшно… Але я хотів продовження, я хотів залишатися в тому дивовижному світі…
                <br /><br />
                <i>Обкладинки роману Патріка Зюскінда «Парфумер. Історія одного вбивці».</i>
            </p>

            <div class="photo-3col">
                <img src="/images/blog/img-blog-14.jpg" alt="" />
                <img src="/images/blog/img-blog-15.jpg" alt="" />
                <img src="/images/blog/img-blog-16.jpg" alt="" />
            </div>

            <p>
                Навіщо нам потрібні метафори? Почнемо з текстів і далі розглянемо, як це працює в дизайні.
                <br /><br />
                🌟 Метафори дають змогу автору передавати складні концепції, почуття, явища в більш доступній, зрозумілій формі, вдаючися до більш знайомих образів.
                <br /><br />
                🌟 Метафори додають до тексту емоційного забарвлення, що допомагає передати глибинні почуття та емоції героїв. Вони також можуть викликати різні асоціації, що додає тексту нові виміри та значення.
                <br /><br />
                🌟 Метафори допомагають запам’ятовувати текст, оскільки вони надають йому конкретний образ та візуальну форму.
                <br /><br />
                🌟 Метафори можуть додати глибини та складності тексту, що дозволяє читачам бачити його з різних перспектив та розуміти його більш повно.
                <br /><br />
                Якщо узагальнити, то можна сказати, що метафора є важливим елементом літературного стилю, який допомагає передавати складні ідеї та почуття в доступній та ефективній формі.
            </p>

            <hr/>

            <p>
                Тепер подивімося на сферу дизайну.
                <br /><br />
                <strong>Метафори використовуються в дизайні, аби допомогти користувачам зрозуміти функціональність інтерфейсу, пов’язуючи певні функції із чимось знайомим.</strong> Використовуючи метафори, дизайнери можуть спростити складні концепції за допомогою впізнаваних і зрозумілих елементів, полегшуючи користувачам взаємодію з інтерфейсом і навігацію ним.
                <br /><br />
                І якщо в літературному творі метафори можуть траплятися не так уже й часто, то в дизайні вони використовуються повсюдно. Ми, дизайнери, не маємо можливості зайвий раз щось розповісти чи пояснити словами. Простір та кількість слів, що нам дозволено сказати, завжди дуже лімітовані, тож візуальна метафора стає нашою головною зброєю.
                <br /><br />
                Метафорами просякнуте все цифрове — від великих абстрактних концепцій до найдрібніших іконок. Приклади: 
                <br /><br />
                🖥 Робочий стіл — ця метафора використовує концепцію фізичного столу для представлення цифрового інтерфейсу. Подібно до фізичного робочого столу, цифровий інтерфейс має теки та файли.
                <br /><br />
                🛒 Кошик для покупок — зазвичай використовується на вебсайтах інтернет-магазинів для представлення процесу додавання товарів до фізичного кошика. Користувачі можуть додавати товари до кошика, переглядати їхній вміст і оформлювати замовлення, коли вони готові завершити купування
                <br /><br />
                🎲 Метафора гри. Ця метафора використовується в різних типах цифрових інтерфейсів, щоб створити відчуття веселощів і залучення. Наприклад, індикатори прогресу можуть виглядати як ігрові рівні, або користувачі можуть здобувати значки чи досягнення за виконання певних завдань.
                <br /><br />
                🎨 Увесь інтерфейс будь-якого графічного редактора — набір різноманітних метафор: рука для того, аби щось посунути, хмаринка для додавання коментаря, відро з фарбою для заливки кольором тощо.
                <br /><br />
                Метафори можуть бути потужним інструментом у цифровому дизайні. <strong>Вони допомагають користувачам швидко розуміти інтерфейси та взаємодіяти з ними. Коли ми кажемо «інтуїтивно зрозумілий», то маємо на увазі, що в цьому інтерфейсі саме всі метафори є зрозуміли.</strong> Метафори простору, дій та наслідків. Так, використовуючи знайомі концепції та досвід, дизайнери можуть створювати інтерфейси, які є більш зручними для користувачів.            
            </p>

            <hr/>

            <p>
                Але! <strong>Так само як і в літературі, метафори в дизайні роблять продукт естетично привабливим, дарують певні емоції, насолоду, підвищують шанси запам’ятатися користувачеві.</strong>
                <br /><br />
                Будь-яке зберігання файлу можна зобразити дискетою, проте це банально, а молодим поколінням може бути вже й геть незрозуміло. По суті це візуальне кліше — метафора, яка втратила свою силу, але цим багато хто користується й досі. Найважливішою характеристикою кліше є те, що вони спочатку були оригінальними, дотепними та винахідливими. 
                <br /><br />
                Ця метафора віджила своє, тому ми шукаємо нові. Метафора надсилання повідомлення? Знову цей клятий паперовий конверт? Чи цього разу літачок? А як щодо блискавки, чи може крила з Гермесових сандалій? 🙃
                <br /><br />
                «Хто володіє запахом, той володіє серцями людей…» — одна з найбільш цитованих фраз із роману «Парфумер». Ми можемо накласти цей принцип на світ метафор — хто вміє їх створювати, той володітиме серцями та розумами людей.
            </p>

            <p>
                <img class="img-float-left" src="/images/blog/img-blog-17.jpg" alt="" />
                А на вашу думку, яка з метафор є найбільш клішованою в візуальній комунікації? Моя «улюблена» — лампочка як символ креативності.
            </p>
        `
    },
    "portfolio3": {
        title: "Портфоліо 3-ї хвилі",
        html: `
            <h1>Що таке портфоліо 3-ї хвилі, чому це важливо для пошуку роботи і як його зробити</h1>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-18.png" alt="" />
            <p>
                Що спільного між кавою та вашим портфоліо? Уявімо портфоліо, як філіжанку цього ароматного напою. Так само як і кава, портфоліо має досягти ідеального балансу між сміливим і витонченим!
                <br /><br />
                Зерна (то ваші проекти) мають бути ретельно відібрані та обсмажені до досконалості, представляючи найкраще з того, що ви можете запропонувати. Кожне зерно є унікальним, зі своїм виразним смаковим профілем. Аромат (ваш візуальний дизайн) приваблює і заманює, вбираючи очі потенційних клієнтів або роботодавців своєю охайністю…
                <br /><br />
                Ну, добре, добре! Я просто не міг стримати себе від цієї паралелі, коли мова заходить про «3-тю хвилю» 😁 Але нумо до нашої справи!
                <br /><br />
                Сьогодні говоримо про зміну підходів до створення портфоліо, чому це сталося і яким має бути дизайнерське портфоліо сьогодні.
            </p>
            
            <h2>1. Чому саме 3-тя хвиля?</h2>
            <p>
                Жарти жартами, а 3-тю хвилю дійсно можна виокремити. Звісно, йдеться не лише про оформлення портфоліо, а про концепцію «дизайнера цифрових продуктів» загалом, що змінюється із часом і під впливом різноманітних подій.
                <br /><br />
                А зміни в самопрезентації, зокрема в портфоліо — це вже певний наслідок усіх цих масштабних трансформацій.
            </p>

            <h3>1.1 Хвиля перша — ремісництво</h3>
            <p>За часів, коли всі були «веб дизайнерами», портфоліо мало демонструвати насамперед технічні навички спеціаліста — вміння робити привабливий дизайн.</p>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-19.png" alt="" />
            <p>І було круто, коли в глядача виривалося невимушене: «О, вау!», що супроводжувалося краплями слини з рота. </p>
            
            <h3>1.2 Хвиля друга — дизайн-процес</h3>
            <p>Далі набрав обертів UX дизайн. Ми заговорили про юзабіліті. Діди дизайну почали писати книжки та формалізували теорію. Дизайнери почали більше працювати із дослідженнями, аналізом даних, вивчати проблеми користувачів, узяли на озброєння дизайн-мислення, ітеративний підхід.</p>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-20.png" alt="" />
            
            <p>
                Дизайн-процес став домінантною. Разом із формулюванням проблеми, результатами досліджень, гіпотезами та рішеннями, опис процесу пошуку рішень мав бути обов’язково продемонстрований у портфоліо. Бо інакше не comme il faut. Питання: «Опишіть ваш дизайн процес», — обов’язково лунало під час першого ж інтерв’ю. Ймовірно, ще кілька разів потім.
            </p>

            <h3>1.3 Хвиля третя — вплив</h3>
            <p>А далі сталася пандемія. Почалося повномасштабне вторгнення орків в Україну. Війна додала обертів світовій економічній кризі, яка й так уже вирувала та, яка не аби як вдарила по цифровій індустрії. Популяризація ШІ. Масові звільнення.</p>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-21.png" alt="" />
            <p>Перенасиченість ринку талановитими дизайнерами разом з усім вищезазначеним, запустила чергові зміни вимог до дизайнерів, бачення їхньої зони відповідальності, навичок та процесу найму.</p>
            <hr />
            
            <h2>2. Як тепер шукають дизайнерів роботодавці та як приймаються рішення?</h2>
            <p>
                Навіть худенький стартап, що з’явився вчора після дощу, дістане сотню резюме на вакансію UX/UI дизайнера (замість кількох, як то було раніше). І дизайн-менеджери, ейчари, керівники компаній зіткнулися з проблемою: усі пречудові кейси дизайнерів, як один, рясніють подвійними діамантами, ваєрфреймами та «фінальними» екранами. <strong>Портфоліо продає спеціаліста, як такого, що знає всю теорію, дизайн-процес, вміє думати та краще чи гірше вміє в UI (це вже, якщо дуже пощастить).</strong>
                <br /><br />
                Проте чи були поставлені проблеми розв’язані та наскільки успішно? Як змінилися показники метрик? Та чи взагалі якісь бізнес-метрики були в голові дизайнера, як той сідав ітерувати над дизайном?
                <br /><br />
                Якщо узагальнити, то більшій частині портфоліо бракує відповіді на питання: який вплив мала ця робота на бізнес?
            </p>

            <blockquote>
                Додатковий матеріал. Гарна стаття від дизайнера в Atlassian, з промовистою назвою: <a href="https://medium.com/designing-atlassian/how-focusing-on-process-is-ruining-your-design-portfolio-f90cfaade0fc"><i>How focusing on process is ruining your design portfolio.</i></a>
            </blockquote>

            <p>
                <strong>Тож, на що звертають увагу тепер?</strong>
                <br /><br />
                2.1 Процес пошуку рішень усе так само важливо бачити в портфоліо кандидата. Проте фотографії людей, з якими проводилися інтерв’ю, скріншоти з Hotjar, наліпки на дошці, що дизайнер сфотографував під час чергового воркшопу (або взяв на стоках) тощо — усе це зайве й лише відволікає від головного.
                <br /><br />
                <br /><br />Контексту має бути рівно стільки, скільки необхідно для розуміння того, яку проблему вирішував дизайнер.</strong>
            </p>

            <blockquote>
                Додатковий матеріал. Прекрасна стаття <a href="https://dataanddesign.substack.com/p/are-you-boring-your-interviewer-by">Are you boring your interviewer by over-explaining context?</a>, що підкреслює важливість подання обмеженого контексту глядачам. 
                <br /><br />
                «Ви ніколи не зможете повністю пояснити контекст, і краще навіть не намагайтеся… Неможливо передати контекст повністю, але така спроба часто відвертає увагу від того, що є дійсно важливим».
            </blockquote>

            <p>
                2.2 Який **вплив** робота та представлені дизайн-рішення мали на бізнес? Які метрики використовувалися для аналізу успішності рішень: чи знизили drop off, покращили рейтинг продукту в магазині, збільшили конверсію… Що сталося в кінці і як дизайнер знає, що досяг успіху?
                <br /><br />
                2.3 Робота має бути **розказана** й містити персоналізовану історію, що виділяється та запам’ятовується на тлі сотень інших резюме та портфоліо.            
            </p>

            <h2>3. Як має виглядати ваше портфоліо сьогодні?</h2>
            <p>Гарні поради дає Моллі Кокс у своєму <a href="https://www.linkedin.com/feed/update/urn:li:activity:7180994903567425537/">Design Portfolio Playbook</a> і заразом покроково описує, як саме вона проводить портфоліо ревью. Зверніть увагу, скільки разів на цих слайдах трапляється порада: «розповідати історію, робити кейси персоналізованим» (як і все портфоліо загалом). Моллі навіть пропонує називати case studies відтепер просто stories. Я погоджуюся!</p>


            <h3>3.1 Сторітелінг</h3>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-22.png" alt="" />

            <p>Певно, я вже задовбав вас своїми порадами озброюватися сторітелінгом, але портфоліо є вашим головним інструментом продажу. Найкращий метод продажів — це приємна комунікація, яка відгукується іншим та пробуджує цікавість. До цього часу портфоліо дизайнерів нагадували, швидше, скріншоти контекстів їхньої роботи, аніж цілісні історії, що здатні продавати експертизу. </p>
            <blockquote>
                Додатковий матеріал. Щодо принципів побудови наративу та схем роботи зі сторітелінгом, ви можете знайти це в моїй попередній статті <a href="https://medium.com/ux-planet/storytelling-for-designers-186c56caa7e3"> Storytelling for designers.</a>

                <br /><br />
                Які питання поставити собі, аби створити історію проекту, ви знайдете також <a href="https://uxplanet.org/most-of-the-portfolios-i-review-have-these-key-problems-c2d96466f502">у цій короткій статті</a>.
            </blockquote>

            <h3>3.2 Менше процесу, більше результатів</h3>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-23.png" alt="" />
            <p>
                Ваше портфоліо має бути зосереджене на кінцевих результатах, а не на артефактах процесу. Красиві user flows та customer journey maps, створені спеціально для портфоліо, більше нашкодять своєю фіктивністю, аніж дадуть якусь користь.
                <br /><br />
                А під результатами ми розуміємо не лише фінальні дизайн-макети, а історію того, як вони вплинули на компанію, для якої ви цей дизайн створили та від якої отримали гонорар за свою роботу.
            </p>

            <h3>3.3 Метрики та орієнтація на бізнес</h3>
            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-24.png" alt="" />

            <p>
                Починайте кожну роботу з формулювання проблеми та зазначення тих метрик, які ви погодили з командою для моніторингу та аналізу. Завершуйте свою історію відповіддю на питання, чи вдалося вам розв’язати поставлену проблему і якщо так, то як ви це зрозуміли. Для цього використовуйте цифри зазначених на початку метрик.
            </p>

            <hr/>

            <h2>4. Приклади робочих історій 3-ї хвилі</h2>
            <p>На завершення нумо дивитися приклади!</p>

            <h3>4.1 <a href="https://www.ramotion.com/support-portal-redesign/">Turo support portal redesign by Ramotion</a></h3>
            <p>
                Це чи не одна з найкращих студій цифрового дизайну у світі, так що не дивно, що їхня робота йде в мене першою. На що звернути увагу: 

                <ul>
                    <li>Вплив зазначений уже в заголовку роботи: Improving self-service by 30 %.</li>
                    <li>Достатня кількість контексту.</li>
                    <li>Прекрасний опис проблеми із використанням реальних показників.</li>
                    <li>Вже на початку зазначені конкретні цілі та метрики.</li>
                    <li>Елегантна демонстрація рішень.</li>
                    <li>Завершення історії розробки зазначенням досягнутих результатів і того, як змінилися метрики.</li>
                </ul>
            </p>


            <h3>4.2 <a href="https://www.behance.net/gallery/187408993/Swiftwash-Laundry-UIUX-Mobile-App-Case-Study?tracking_source=curated_galleries_ui-ux">Swiftwash Laundry UI/UX Mobile App Case Study by Orbix Studio</a></h3>
            <ul>
                <li>Гарний приклад сторітелінгу.</li>
                <li>Ознайомлення з проблемами та пропонованими рішеннями.</li>
                <li>Оформлення і демонстрація результатів та впливу дизайну на бізнес.</li>
            </ul>


            <h3>4.3 <a href="https://www.behance.net/gallery/189084267/Healthcare-Platform-UIUX-Design-Mobile-App-Design?tracking_source=curated_galleries_ui-ux">Healthcare Platform by Arounda</a></h3>
            <ul>
                <li>Достатня кількість контексту та опис проблеми.</li>
                <li>Ідеальний баланс артефактів в історії, аби зрозуміти, що це якісна робота, зацікавитися і бажати дізнатися більше.</li>
                <li>Чудове оформлення результатів із використанням метрик.</li>
            </ul>

            <h3>4.4 <a href="https://medium.muz.li/finding-safe-and-compatible-travel-partners-within-communities-a-ux-case-study-f536a3d8f173">Finding Safe and Compatible Travel Partners within Communities by Nizwa</a></h3>
            <p>Це приклад гарного сторітелінгу й того, як можна подавати інформацію (ті самі ж метрики), в умовах нестачі даних (частий кейс у навчальних проектах).</p>
            
            <h3>4.5 <a href="https://www.rachelhow.com/design/fave-landing-page">Increasing app installs by 600 % on Fave's new landing page by Rachel How</a></h3>
            <p>Від початку історії ми одразу розуміємо, що це не тільки про дизайн, а і про те, як він вплинув на компанію та її подальший розвиток. А вже потім маємо і процес, і артефакти, і все, що потрібно для оцінки навичок дизайнера.</p>


            <p>Друзі, на цьому все на сьогодні. Бажаю вам успіхів, а вашим новим кейсам історіям легко застрибнути на гребень 3-ої хвилі 🌊</p>
        `
    },
    "presentation-checklist": {
        title: "Контрольний список характеристик для ефективної презентації дизайну",
        html: `
            <h1>Контрольний список характеристик для ефективної презентації дизайну</h1>

            <h3>Або як ділитися своїми напрацюваннями у найефективніший спосіб</h3> 

            <img  src="/images/blog/img-blog-25.png" alt="" />

            <p>
                Зворотний зв’язок для дизайнера — це двигун прогресу! Мене, бува, питають: «А як зрозуміти, що я вже виріс із джуніора?». То я відповідаю, що основним показником буде ставлення до зворотного зв'язку і того, наскільки активно дизайнер його шукає. Річ у тім, що молоді дизайнері більш тремтливо дивляться на свої дизайни, бачать свої макети, не стільки як певні технічні рішення, а як витвори мистецтва. Коли такий підхід перестає бути актуальним, тоді джун стає спеціалістом!  
                <br /><br />
                Далі настає час для шліфування навички ефективної комунікації. Найгірший сценарій — це закинути своїм колегам, менеджерам, замовниками макети та запитати їх: «Ну, як вам? Сподіваюся, подобається»! Таким чином ви відкриваєте двері у справжні джунглі фідбеку, з водоспадами коментарів, на тему й не дуже, з купою питань тощо. Тож чи то під час презентації у крос-функціональній команді, чи на критичній сесії серед дизайнерів, чи перед ширшою аудиторією, чітка комунікація є ключем до вдосконалення вашого дизайну.
                <br /><br />
                Надання й отримання зворотного зв’язку може бути непростим завданням. Адже те, як ви запитуєте та сприймаєте фідбек, суттєво впливає не тільки на розвиток проєкту та якість ваших макетів, але й на моральний дух команди і культуру в компанії. Тому важливо презентувати вашу роботу ефективно. 
                <br /><br />
                Цей короткий чек-лист допоможе вам підготуватися до чергового дизайн-ревью (aka дизайн-критики). Слайди чи демонстрація у Figma? Який контекст надавати? Скільки? Чи показувати ітерації, чи тільки фінальне рішення? Все це потребує вашої уваги та правильного підходу. Зрештою, практика презентацій веде вас до набуття чергової необхідної навички — вмінню «продавати» ваші рішення.
            </p>

            <blockquote style="font-style: normal">
                <strong>Перший крок будь-якої презентації — правильно налаштувати сцену.</strong>
                <br /><br />
                Найважливішим фактором, який визначатиме структуру вашої презентації, є те, чи перебуваєте ви на ранніх стадіях проекту, чи на етапі його реалізації.
            </blockquote>

            <p>Наприклад, якщо ви знаходитися на ранніх етапах (Discovery), важливо зосередитися не стільки на естетиці дизайну, скільки на обговоренні результатів досліджень, бізнес-цілей та потреб користувачів. А макети, що виблискують певними кольоровими пікселями можуть стати вам на завади.</p>
            
            <h3>Discovery</h3>
            <ul>
                <li>
                    <p>Вступ:</p>
                    <ul>
                        <li>
                            <p>Постановка задачі</p>
                            <ul>
                                <li>Що я вирішую і чому — яку цінність це принесе користувачеві та/або бізнесу?</li>
                                <li>Для кого я вирішую цю проблему — для користувачів чи для бізнесу?</li>
                                <li>Яка пріоритетність цієї задачі?</li>
                            </ul>    
                        </li>
                    </ul>
                </li>
                <li>
                    <p>Результати:</p>
                    <ul>
                        <li>
                            <p>Визначте сценарії</p>
                            <ul>
                                <li>Попрацюйте з продукт-менеджером над ймовірними сценаріями, для яких необхідно розробити проект.</li>
                                <li>Використовуйте User Flow / Task Flow, щоб візуалізувати їх.</li>
                            </ul>    
                        </li>
                        <li>Який функціонал наразі існує, а якого ще немає?</li>
                        <li>Які дані досліджень доступні? Які дослідження ще треба провести?</li>
                        <li>Які пропозиції були зроблені та які ітерації були проведені? Які найбільш перспективні варіанти подальшого розвитку і чому?</li>
                    </ul>
                </li>
            </ul>

            <blockquote style="font-style: normal">
                Якщо ви презентуєте дані досліджень, дорожні мапи, tasks або user-flows, то в жодному разі не використовуйте презентацію в слайдах. Річ у тім, що слайди завжди сприймаються, як демонстрація готових рішень. Слайди — це завжди про щось таке, що можна відправити далі, поділитися з іншими. Краще за все, буде зібрати все на одному артборді у Figma, FigJam, або Miro.
            </blockquote>
            <blockquote style="font-style: normal">
                З вашими ідеями для візуалізації рішень працюйте на рівні low-fidelity wireframes. Уникайте шліфування пікселів. Сконцентруйтеся на створенні якомога більшої кількості концептів. 
            </blockquote>

            <h3>Delivery</h3>
            <ul>
                <li>
                    <p>Вступ:</p>
                    <ul>
                        <li>
                            <p>Освіжаємо контекст</p>
                            <ul>
                                <li>Яку проблему ми вирішуємо?</li>
                                <li>Презентація доступних даних і результатів усіх попередньо проведених досліджень.</li>
                            </ul>    
                        </li>
                    </ul>
                </li>
                <li>
                    <p>Результати:</p>
                    <ul>
                        <li>
                            <p>Специфікації інтерфейсу:</p>
                            <ul>
                                <li>Зберіть усі макети, що авдиторія має розглянути на одній сторінці в Figma та уникайте стрибків між файлами.</li>
                                <li>Розкажіть історію того, як ви прийшли до фінального рішення та покажіть основні ітерації, які були на шляху до нього. </li>
                                <li>За наявності надайте посилання на інтерактивний прототип. </li>
                                <li>Які існують технічні виклики і що ще потрібно вирішити? </li>
                                <li>З якими edge cases ви зіткнулися та як збираєтеся їх вирішувати?</li>
                            </ul>    
                        </li>
                        <li>Які наступні кроки (користувацькі тестування, контроль якості дизайну (QA), відстеження показників)?</li>
                    </ul>
                </li>
            </ul>

            <blockquote style="font-style: normal">
                На цьому етапі можлива слайд-презентація, яка міститиме посилання на ваші Figma файли з остаточним дизайном і специфікаціями. 
            </blockquote>

            <p>На цьому все! Я сподіваюся, що цей контрольний список стане вам у пригоді, а ваші презентації стануть ефективнішими! </p>
        `
    },
    "revolution": {
        title: "«Революція» в цифровому дизайні",
        html: `
            <h1>«Революція» в цифровому дизайні</h1>
            <p>
                Сьогодні відбуваються доволі радикальні зміни в тому, як дизайнери працюють та розв’язують задачі. Змінилися інструменти, змінився навіть підхід до оцінки навичок дизайнерів. 
                <br /><br />
                Почнемо з <strong>інструментів.</strong> Останні кілька місяців я спостерігаю цікавий виток у використанні дизайн інструментів командами, як у маленьких стартапах, так і у великих компаніях. Але правильніше сказати — НЕ використанні, або їхньому максимальному обмеженні.
                <br /><br />
                Як ви чудово знаєте, після епохи монополії фотошопів, на ринок зайшло багато чудових інструментів для створення ваєрфреймів, дизайн-макетів, прототипів, інтеракцій тощо. <a href="https://www.youtube.com/watch?v=J4XuVHffOUI&t=1s">У цьому відео</a>, якому до речі вже більше 3-х років, можна чітко побачити наскільки багато їх було вже тоді. Сьогодні ж до цього списку додалася ще й Figma, а Framer та Protopie стали простими та дієвими, Sketch наростив м’язи…
            </p>

            <iframe class="aspect-16-9" width="560" height="315" src="https://www.youtube.com/embed/J4XuVHffOUI?si=q_MGSyBVaMuz-2HC" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
            
            <p>
                І от зараз до дизайнерів і бізнесу прийшло усвідомлення, що ринок остаточно перенаситився. Ми почали витрачати занадто багато часу лише на вибір «правильного» інструменту, на переходи зі Sketch на Figma, на намагання знайти правильну тулзу, аби продемонструвати розробникам, як має працювати та чи інша фіча, чи анімація.
                <br /><br />
                Настав момент істини, про який так багато говорили останні роки. 
                <br /><br />
                Тоді ж, 3 роки тому, я писав <a href="https://telegraf.design/prognozy-rozvytku-tsyfrovogo-prodakt-dyzajnu-dumky-spetsialistiv/">статтю до Телеграфу</a>, у якій зібрав прогнози різних дизайнерів. Один мій знайомий, що працював у Preply, а тепер є співробітником великої берлінської компанії HelloFresh, сказав тоді так: 
                <br /><br />
                <i>«Продукт-дизайнер буде ближче до розвитку бізнесу: користувацький досвід та стратегія розвитку продукту щільно пов’язана з ефективністю дизайн-рішень та їхнім впливом на зростання компанії.</i>
                <br /><br />
                <i>Дослідження та розуміння когнітивної психології, котрим ми наразі не приділяємо достатньо уваги, стануть основним інструментом розуміння людей, формулювання гіпотез та створення досвіду взаємодії.</i>
                <br /><br />
                <i>Інструменти та сервіси для дизайну стануть більш автоматизованими й це допоможе нам сфокусуватися на створенні цінності для людей через продукти.</i>
                <br /><br />
                Я можу сказати, що цей момент настав. Основним інструментом у якому тепер щодня працюють дизайнери є здебільшого <a href="https://miro.com">Miro</a>. Універсальний, легкий, максимально автоматизований і розрахований перш за все на побудову ефективної комунікації. Він дозволяє формалізувати гіпотези, синхронізувати бачення, комунікувати з іншими командами, робити презентації та створювати дизайн на low-fidelity рівні.
                <br /><br />
                Так, ми використовуємо Figma, Sketch тощо. Але робота в цих інструментах йде макимально швидко й ми прагнемо якомога більше її автоматизувати за допомогою вже відомих патернів, готових бібліотек і дизайн-системи. Ми фіналізуємо обране рішення та робимо його специфікацію, але це 15-20% відскотків від усього робочого часу.
            </p>

            <hr/>

            <p>Я також спостерігаю масштабне зміщення оцінки навичок дизайнерів у процесі інтерв’ю та пріоритизацію розвинених soft, а не стільки hard навичок. Звісно, портфоліо все ще грає важливу роль. Проте лише на етапі скринінгу. Ба більше потенційного роботодавця цікавить тепер більше постановка проблеми, історія її дослідження, пошук та валідація рішення, короткий огляд результатів. І під результатами маються на увазі не лише дизайн-макети, але й чіткі метрики та цифри, що характеризують успіх або провал для бізнесу.</p>
            
            <blockquote style="font-style: normal" class="quote-warning">
                Розуміння бізнесу, метрик, конкурентного оточення, специфіки індустрії та власного продукту — усе це стало важливішим за знання графічних редакторів.
            </blockquote>

            <p>
                👱🏻‍♂️  <strong>Розуміння користувача.</strong> Аби створити ефективне рішення та кінцевий продукт, ви маєте розуміти людей, які будуть користуватися вашим продуктом і ті проблеми, з якими вони стикаються під час використання вашого продукту/інших продуктів. Отже, навички з психології, комунікації та досліджень також уже вийшли на передній план.
                <br /><br />
                🙋  <strong>Відповідальність.</strong> Це одна з найважливіших навичок для дизайнерів. Ви повинні відповідати за всі свої дії, вимоги та рішення, а також бути в контакті з усіма іншими людьми, хто бере участь у проєкті. Часи, коли зона відповідальності дизайнера зводилася до рухання та фарбування пікселів уже в минулому.
                <br /><br />
                🤝  <strong>Командна робота та soft skills.</strong>
                Ви можете бути тричі інтровертом (як я, наприклад), але якщо вас дратує велика кількість зустрічей з іншими членами команди — вам не досягти прогресу в кар’єрі дизайнера. Ми стали містком між різними спеціалістами та командами, об’єднувальною ланкою та зберігачами продуктового знання.
            </p>

            <hr/>

            <p>
                ✌️  <strong>Замість висновку. </strong> Ще рік тому, я б сказав, що спочатку треба опанувати графічні редактори, базові інструменти, а вже потім рухатися в напрямі розвитку soft skills. Часи та середовище змінилися. І тепер ці пріоритети обмінялися місцями.
            </p>
        `
    },
    "whats-next": {
        title: "Напередодні змін",
        html: `
            <h1>Напередодні змін</h1>

            <h3><i>Або як давньоримський архітектор підказує нам, дизайнерам, що робити далі</i></h3>
            
            <p>
                Разом зі звітом <a href="https://trends.uxdesign.cc/" target="_blank">State of UX</a> та передбаченням, щодо зміни ролі дизайнерів у найближчому майбутньому, мені трапилася паралельно ще одна стаття, але зовсім про інше — про «Вітрувіанську людину», Леонардо да Вінчі. Ця стаття, однак, відіграла роль цікавого доповнення загальної картини прийдешніх змін.
                <br /><br />
                Я впевнений, що ви бачили цю картину десятки, чи навіть сотні разів. Проте чи знаєте ви чому вона називається саме «Вітрувіанська людина»?
            </p>

            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-26.jpg" alt="" />

            <p>
                Давньоримський архітектор Вітрувій, вважав людські пропорції основою класичної архітектури. І саме його записи надихнули Леонардо на створення одного з найвідоміших малюнків в історії мистецтва й навіть дали поштовх до початку італійського ренесансу.
                <br /><br />
                Марк Вітрувій Полліон жив у Римі в I столітті до нашої ери, служив військовим інженером і артилеристом при Юлії Цезарі, воював і працював на території сучасних Іспанії, Франції, Туреччини та Тунісу. Уже на пенсії Вітрувій написав трактат De Architectura, що був частково про історію, частково путівником грецькою та римською архітектурою.
            </p>

            <img style="width: 75%; margin: 0 auto" src="/images/blog/img-blog-27.jpg" alt="" />

            <p>
                У своїй роботі він стверджував, що архітектори мають вміти малювати, розуміти мистецтво, знати історію, музику, хімію, астрономію, право, медицину, поезію та філософію.
                <br /><br />
                Ось кілька цитат, що обґрунтовують його твердження:
            </p>

            <p class="editor-block-border-left">
                <i>«Філософія робить архітектора не самовпевненим, а ввічливим, справедливим і чесним без скупості.»</i>
            </p>

            <p class="editor-block-border-left">
                <i>«Музика потрібна, аби архітектори могли налаштувати балісти та катапульти в потрібному ключі.»</i>
            </p>

            <p class="editor-block-border-left">
                <i>«Архітектор повинен також мати знання з медицини, що стосуються питань клімату, повітря, здоров’я місцевості, використання різних вод. Адже без цих міркувань здоров’я житла не може бути гарантоване.»</i>
            </p>

            <p class="editor-block-border-left">
                <i>«А що стосується принципів права, архітектор повинен знати ті із законів, які необхідні у випадку будівель, що мають бічні стіни, щодо води, яка капає з карнизів, а також закони про водостоки, вікна і водопостачання.»</i>
            </p>

            <p>
                До такого різномаїття експертиз підштовхує і нас, дизайнерів, сьогоденний технологічний розвиток. На початку ми ставили собі питання: «Як створити інтерфейс привабливим?» та розвивали наші навички UI. Далі ми пірнули в дослідження, аби робити інтерфейси та продукти зручними, легкими для сприйняття та корисними в розв’язанні користувацьких проблем. UX/UI та продукт дизайнери в більшій чи меншій мірі здобули знання з психології та соціології.
                <br /><br />
                <strong>Що далі?</strong>
                <br /><br />
                Особливо це питання стає актуальним саме сьогодні, з урахуванням того, що і UI та UX частини будуть автоматизовані. Дивлячись на усю ту конкуренцію, що зараз точиться навколо ШІ інструментів: ChatGPT, Pi, Midjourney, нещодавній анонс (хоч і <a href="https://www.youtube.com/watch?v=q5qAVmXSecQ" target="_blank">скандальний</a>) продукту <a href="https://youtu.be/v5tRc_5-8G4?si=zLNEvndU2_Ryimi9" target="_blank">Gemini від Google</a>, у цьому вже не лишається жодного сумніву. Це питання короткострокової перспективи.
                <br /><br />
                Тож, на мою думку, ми маємо додати до коктейлю наших експертиз знання із цих 3-х наукових галузей:
            </p>

            <h3><strong>1. Філософія, зокрема, етика</strong></h3>
            <p>
                Нам дедалі частіше доводиться боротися з «темними патернами» та бажанням бізнесу нажитися на користувачах, всадити їх на дофамінову гоку, чи заплутувати користувацький шлях задля матеріальної вигоди. О, скільки разів я кричав на весь офіс: «Це неправильно! Це нечесно! Це аморально» тощо. Проте мене ніхто не чув. Адже кінець кінцем, але це бізнес платить мені зарплатню і моє завдання робити так, аби він масштабувався, а продукт приносив більше коштів.
                <br /><br />
                Етика — розділ філософії, що вивчає мораль, суспільні норми поведінки та концепції «правильної та неправильної поведінки». Термін був запропонований Арістотелем, як позначення особливої галузі дослідження «практичної» філософії, тому що вона намагається відповісти на питання: **що ми повинні робити?** Основною метою етики Арістотель називав щастя, що ототожнював із самореалізацією. А самореалізація — це розумні вчинки людини, яка уникає крайнощів і тримається золотої середини. Тому основна чеснота людини — це помірність і розсудливість.
                <br /><br />
                Філософія та етика в арсеналі дизайнера? Так, може лунати дивно. Проте, чим далі я поринаю в її вивчення, тим більше я знаходжу можливостей для артикуляції власних рішень, що стосуються моєї адвокатської діяльності із захисту прав користувачів. Дизайнери вже давно стали представниками та основним голосом користувачів у бізнесі. У цифровому світі, що сповнений фейковою інформацією, підписками на все підряд, темними патернами, ми маємо зробити все можливе, аби цей голос став міцнішим та голоснішим.
            </p>
            

            <h3><strong>2. Право</strong></h3>

            <p>
                Директива ЄС 2019/882 має на меті створити спільний стандарт доступності для основних продуктів і послуг, включно із цифровими. Вона застосовується до виробників комп’ютерів та операційних систем, банкоматів, квиткових автоматів, банківських послуг, вебсайтів та застосунків для електронної комерції тощо. Директив була прийнята ЄС у червні 2019-го року, імплементована в національне законодавство країн-членів у червні 2022-го року та має бути повністю введена в дію до червня 2025 року.
                <br /><br />
                У США, Канаді, Австралії та інших країнах здійснюються аналогічні заходи, що мають на меті законодавчо закріпити норми доступності цифрових продуктів для користувачів.
                <br /><br />
                Проте в технологічній індустрії досі є безліч підприємців, менеджерів продуктів, дизайнерів і розробників, які й не чули про ці законодавчі норми, а що цікавіше — про доступність (accessibiliy).
                <br /><br />
                Але ж не знання законів не звільняє від відповідальності. І хоча держави та їхнє законодавство не встигає за технологічним розвитком, проте вже дуже скоро, ви та ваш продукт, можуть стати причиною подання позову до суду, у разі, якщо він не відповідатиме нормам WCAG.
                <br /><br />
                Тож знання законодавчої бази, що регулює якість та доступність цифрових рішень, однозначно, стає актуальною для творців цих самих продуктів.
            </p>


            <h3><strong>3. Бізнес та підприємництво</strong></h3>
            <p>
                Звісно, це найочевидніший пункт. Розуміння бізнес-сторони справи допомагає дизайнерам створювати продукти, які не лише естетичні та зручні, але і прибуткові та відповідають потребам клієнтів.
                <br /><br />
                Знання тонкощів бізнесу може допомогти дизайнерам краще співпрацювати з іншими командами: маркетингом, відділом продажів, фінансами тощо.
                <br /><br />
                Розуміння бізнес-ландшафту може допомогти дизайнерам виявити нові можливості та відповідним чином переорієнтувати свою роботу.
                <br /><br />
                Говорити мовою бізнесу й робити реальний вплив на кінцевий результат — це вже не просто слова, а нагальна необхідність для дизайнерів, аби залишатися потрібними на ринку праці.            
            </p>

            <hr/>
            <p>Попереду нас очікує велика робота із саморозвитку. І в нас немає іншого вибору, якщо ми хочемо й далі залишатися на вістрі технологічного прогресу — ми маємо стати складнішими.</p>
        `
    }
}
{/* 
    <h1></h1>
    <p></p>
    <strong></strong>
    <img src="/images/blog/5.gif" alt="" />
*/}
export default posts1;
